app/views/tasks/_form.html.haml

SELECT "categories".* FROM "categories"
---
= simple_form_for(@task, html: { class: 'form-horizontal'}) do |f|
	= f.collection_select :category_id, Category.all, :id, :name, { prompt: "Choose a Category" }