app/controllers/tasks_controller.rb

	def index
		if params[:category].blank?
			@tasks = Task.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@tasks = Task.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "tasks".* FROM "tasks"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Moving Helping"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 1]]

	def create
		@task = Task.new(tasks_params)

		if @task.save
---
INSERT INTO "tasks" ("title", "description", "company", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		if @task.update(tasks_params)
---
UPDATE "tasks" SET "category_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["category_id", 3], ["updated_at", "2015-11-24 18:18:46.547390"], ["id", 7]]